[
  {
    "category": "Android",
    "title": "Parking Aid",
    "authors": [ "Luke Sapiets", "George Mabey", "Jon Westwood" ],
    "info": "Parking Aid was developed as part of a software engineering project. It is app that allows a user to geotag their car’s location and later use the app to find their way back to the vehicle.",
    "link": "https://github.com/alexlogan-io/parkingaid"
  },
  {
    "category": "Android",
    "title": "Marauders Map",
    "authors": [ "Luke Sapiets", "George Mabey", "Jon Westwood" ],
    "info": "Marauders Map was developed as part of a software engineering project. Inspired by the magical map in Harry Potter (that shows the current location of anyone at Hogwarts) this app does almost the same, but on the UEA campus. It allows a user to enter their schools of interest and thus find the current location of lecturers and student guides or ambassadors in the same school.",
    "link": "https://github.com/alexlogan-io/marauders-map"
  },
  {
    "category": "Node",
    "title": "Prison Voicemail",
    "authors": [ "Kristiana Sizinceva", "Kieran Harrington-Ball" ],
    "info": "Prison Voicemail was the brain child of Kieran, and is a social enterprise that offers prisoners a service that allows them to recieve voicemails from their families. It launched at Lincoln prison in October and the aim is to have it in several countries within a year. Kieran produced much of the design however it was my responsibility to develop the Node and Angular. The application uses the Braintree API to handle credit card payments as well as the TWILIO API to orchestrate sending text messages to users.",
    "link": "www.prisonvoicemail.co.uk"
  },
  {
    "category": "Matlab",
    "title": "Guitar Chord Recogniser",
    "authors": [],
    "info": "For my third year project, I produced a guitar chord recogniser in MATLAB. Chord recognition is a well explored area of music information retrievel, but guitar chord recognition remains a relatively unexplored area. The purpose of this project was to develop a system that could recognise chords played in real time on a guitar and use this to form the basis of a software package that could provide musicians with a teaching or transcription tool. Initial research was carried out on single note and two note chord recognition which achieved accuracies of 74% and 90% respectively. The final system for recognising chords containing an arbitrary number of notes used an implementation of Pitch Class Profiles. A comparison was made between a learnt Bayesian approach and a non-learnt Nearest Neighbour approach. For common chords, the learnt approach produced an accuracy of 99%, compared to 94% using the non-learnt approach. When extended to complex chords, the learnt approach produced an accuracy of 84% and 80% with the non-learnt approach. A real-time demonstration was then produced in MATLAB.",
    "link": ""
  },
  {
    "category": "Matlab",
    "title": "Audio/Visual Speech Recognition System",
    "authors": [ "Luke Sapiets" ],
    "info": "The purpose of this study is to build an individual speech recogniser using a combination of Matlab and HTK, followed by research into how different aspects of the design affect the performance of the recogniser. A secondary element of the study was to identify the effect of noise on the recogniser. This study has found that there is a correlation in the direction of an improvement in the recogniser when various aspects of the design are changed, this is detailed within this report. Noise was found to have a very negative affect on the recogniser, even when testing with improvement methods such as spectral subtraction or adding the velocity and acceleration between each MFCC.",
    "link": ""
  }

]
